УчетИНагрузкаППС/src/Documents/ПроектШтатногоРасписания/ПроектШтатногоРасписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроектШтатногоРасписания</name>
  <registerRecords>InformationRegister.ШтатноеРасписание</registerRecords>
  <registerRecords>InformationRegister.ШтатныеРасписанияПодразделений</registerRecords>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныеГоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Первичный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧасовИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Нагрузка</name>
    <attributes>
      <name>ВидЗаписи</name>
      <type>
        <types>CatalogRef.ВидыЗаписейШтатногоРасписания</types>
      </type>
    </attributes>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗанятости</name>
      <type>
        <types>EnumRef.ВидыЗанятости</types>
      </type>
    </attributes>
    <attributes>
      <name>УченаяСтепень</name>
      <type>
        <types>CatalogRef.УченыеСтепени</types>
      </type>
    </attributes>
    <attributes>
      <name>УченоеЗвание</name>
      <type>
        <types>CatalogRef.УченыеЗвания</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСтавок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УчетИНагрузкаППС/src/Documents/ПроектШтатногоРасписания/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьНаДублиСтрок(Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьНаДублиСтрок(Отказ)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Таблица.ВидЗаписи,
	|	Таблица.Преподаватель,
	|	Таблица.Должность,
	|	Таблица.ВидЗанятости
	|ПОМЕСТИТЬ Нагрузка
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Нагрузка.Преподаватель КАК Преподаватель,
	|	Нагрузка.Преподаватель.Наименование КАК ПреподавательНаименование,
	|	Нагрузка.Должность,
	|	Нагрузка.Должность.Наименование КАК ДолжностьНаименование,
	|	Нагрузка.ВидЗанятости
	|ИЗ
	|	Нагрузка КАК Нагрузка
	|ГДЕ
	|	Нагрузка.ВидЗаписи.УчетДолжностей
	|СГРУППИРОВАТЬ ПО
	|	Нагрузка.Должность,
	|	Нагрузка.ВидЗанятости,
	|	Нагрузка.Преподаватель,
	|	Нагрузка.Преподаватель.Наименование,
	|	Нагрузка.Должность.Наименование
	|ИМЕЮЩИЕ
	|	СУММА(1) > 1");
	
	Таблица = Нагрузка.Выгрузить(, "НомерСтроки, ВидЗаписи, Преподаватель, Должность, ВидЗанятости");
	Запрос.УстановитьПараметр("Таблица", Таблица);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.Преподаватель) Тогда
				ТекстОшибки = СтрШаблон("По преподователю %1 должна быть только одна строка с видом занятости %2 и должностью %3", 
					Выборка.ПреподавательНаименование, Выборка.ВидЗанятости, Выборка.ДолжностьНаименование);
			Иначе
				ТекстОшибки = СтрШаблон("По вакансии %1 должна быть только одна строка с видом занятости %2", 
					Выборка.ДолжностьНаименование, Выборка.ВидЗанятости);				
			КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,, "ТаблицаНагрузки",, Отказ);
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
